<!-- attach-outputs:plan-nodes-prod.txt -->
  <!-- Output: plan-nodes-prod.txt -->
  #### plan-nodes-prod.txt 📖: `test: success, prod: success`

  **Last updated:** Jan 7, 2026, 02:22 AM UTC

  <details><summary>Show Contents</summary>

  ```

  
Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.cluster.module.talos-vm["tiles-cp-1"].proxmox_virtual_environment_vm.main has changed
  ~ resource "proxmox_virtual_environment_vm" "main" {
        id                                   = "7211"
      ~ mac_addresses                        = [
            "00:00:00:00:00:00",
          ~ "92:44:65:E1:DF:30" -> "02:3B:F5:6D:E3:71",
          ~ "1A:1B:E7:CA:92:75" -> "D6:23:8C:C4:18:B9",
            "00:00:00:00:00:00",
            # (4 unchanged elements hidden)
        ]
        name                                 = "tiles-cp-1"
      ~ network_interface_names              = [
            # (6 unchanged elements hidden)
            "ip6tnl0",
          ~ "eth0" -> "ens18",
        ]
        tags                                 = []
        # (32 unchanged attributes hidden)

      ~ cpu {
          + flags        = []
            # (9 unchanged attributes hidden)
        }

        # (6 unchanged blocks hidden)
    }

  # module.cluster.module.talos-vm["tiles-cp-2"].proxmox_virtual_environment_vm.main has changed
  ~ resource "proxmox_virtual_environment_vm" "main" {
        id                                   = "7212"
      ~ mac_addresses                        = [
            "00:00:00:00:00:00",
          ~ "DE:87:CB:9E:78:D0" -> "E6:30:24:26:43:1A",
          ~ "CE:16:50:BB:7A:93" -> "96:3E:58:AE:E8:93",
            "00:00:00:00:00:00",
            # (4 unchanged elements hidden)
        ]
        name                                 = "tiles-cp-2"
      ~ network_interface_names              = [
            # (6 unchanged elements hidden)
            "ip6tnl0",
          ~ "eth0" -> "ens18",
        ]
        tags                                 = []
        # (32 unchanged attributes hidden)

      ~ cpu {
          + flags        = []
            # (9 unchanged attributes hidden)
        }

        # (6 unchanged blocks hidden)
    }

  # module.cluster.module.talos-vm["tiles-cp-3"].proxmox_virtual_environment_vm.main has changed
  ~ resource "proxmox_virtual_environment_vm" "main" {
        id                                   = "7213"
      ~ mac_addresses                        = [
            "00:00:00:00:00:00",
          ~ "3A:3B:AC:86:05:F6" -> "92:1D:17:1F:A8:D6",
          ~ "92:0D:E4:4D:B2:A3" -> "02:01:C7:B3:6D:31",
            "00:00:00:00:00:00",
            # (4 unchanged elements hidden)
        ]
        name                                 = "tiles-cp-3"
      ~ network_interface_names              = [
            # (6 unchanged elements hidden)
            "ip6tnl0",
          ~ "eth0" -> "ens18",
        ]
        tags                                 = []
        # (32 unchanged attributes hidden)

      ~ cpu {
          + flags        = []
            # (9 unchanged attributes hidden)
        }

        # (6 unchanged blocks hidden)
    }

  # module.cluster.module.talos-vm["tiles-wk-1"].proxmox_virtual_environment_vm.main has changed
  ~ resource "proxmox_virtual_environment_vm" "main" {
        id                                   = "7221"
      ~ mac_addresses                        = [
            "00:00:00:00:00:00",
          ~ "96:97:96:95:5C:17" -> "D2:13:1E:10:11:99",
          ~ "FE:34:A2:14:83:B6" -> "06:22:30:6D:78:08",
            "00:00:00:00:00:00",
            # (4 unchanged elements hidden)
        ]
        name                                 = "tiles-wk-1"
      ~ network_interface_names              = [
            # (6 unchanged elements hidden)
            "ip6tnl0",
          ~ "eth0" -> "ens18",
        ]
        tags                                 = []
        # (32 unchanged attributes hidden)

      ~ cpu {
          + flags        = []
            # (9 unchanged attributes hidden)
        }

        # (6 unchanged blocks hidden)
    }

  # module.cluster.module.talos-vm["tiles-wk-2"].proxmox_virtual_environment_vm.main has changed
  ~ resource "proxmox_virtual_environment_vm" "main" {
        id                                   = "7222"
      ~ mac_addresses                        = [
            "00:00:00:00:00:00",
          ~ "B2:1E:AB:C8:9E:6E" -> "02:69:5A:52:18:71",
          ~ "4A:4D:8B:8E:1A:F1" -> "0E:87:D4:4A:3C:05",
            "00:00:00:00:00:00",
            # (4 unchanged elements hidden)
        ]
        name                                 = "tiles-wk-2"
      ~ network_interface_names              = [
            # (6 unchanged elements hidden)
            "ip6tnl0",
          ~ "eth0" -> "ens18",
        ]
        tags                                 = []
        # (32 unchanged attributes hidden)

      ~ cpu {
          + flags        = []
            # (9 unchanged attributes hidden)
        }

        # (6 unchanged blocks hidden)
    }

  # module.cluster.module.talos-vm["tiles-wk-3"].proxmox_virtual_environment_vm.main has changed
  ~ resource "proxmox_virtual_environment_vm" "main" {
        id                                   = "7223"
        name                                 = "tiles-wk-3"
        tags                                 = []
        # (34 unchanged attributes hidden)

      ~ cpu {
          + flags        = []
            # (9 unchanged attributes hidden)
        }

        # (6 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.cluster.onepassword_item.kubeconfig will be created
  + resource "onepassword_item" "kubeconfig" {
      + category   = "secure_note"
      + id         = (known after apply)
      + note_value = (sensitive value)
      + password   = (sensitive value)
      + title      = "tiles-kubeconfig"
      + uuid       = (known after apply)
      + vault      = "lyyqeg3pe6dvqdeb5hbiu7b76y"

      + section {
          + id    = (known after apply)
          + label = "metadata"

          + field {
              + id    = (known after apply)
              + label = "source"
              + type  = "STRING"
              + value = (sensitive value)
            }
          + field {
              + id    = (known after apply)
              + label = "root_module"
              + type  = "STRING"
              + value = (sensitive value)
            }
          + field {
              + id    = (known after apply)
              + label = "module"
              + type  = "STRING"
              + value = (sensitive value)
            }
        }
    }

  # module.cluster.talos_cluster_kubeconfig.this will be created
  + resource "talos_cluster_kubeconfig" "this" {
      + certificate_renewal_duration    = "720h"
      + client_configuration            = {
          + ca_certificate     = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUJQekNCOHFBREFnRUNBaEVBNENrcWNhSCs2dW1yRTlNakFRZFMwVEFGQmdNclpYQXdFREVPTUF3R0ExVUUKQ2hNRmRHRnNiM013SGhjTk1qWXdNVEF6TURFME9UQXlXaGNOTXpZd01UQXhNREUwT1RBeVdqQVFNUTR3REFZRApWUVFLRXdWMFlXeHZjekFxTUFVR0F5dGxjQU1oQUFwM01sTVRSZ202YU9vT3dBZ0FCY1ozSnBUbVA1TjM1OEtoClJLU1g1K1pWbzJFd1h6QU9CZ05WSFE4QkFmOEVCQU1DQW9Rd0hRWURWUjBsQkJZd0ZBWUlLd1lCQlFVSEF3RUcKQ0NzR0FRVUZCd01DTUE4R0ExVWRFd0VCL3dRRk1BTUJBZjh3SFFZRFZSME9CQllFRkd1N0dnUk1WWG8wRmZQMwpuQTY4TXVmNmdpMXBNQVVHQXl0bGNBTkJBTWFQTWREaXBkS2M0MndxakNzUDIvMWlEYXA0RC9QV0Vsc3hzazRFCjRwbnpKdmR0ZzZ2QzVLUGxjZlpkdk5VaDBDWmUvampFcWhicWhSUW4wYitkOVFBPQotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg=="
          + client_certificate = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUJLVENCM0tBREFnRUNBaEVBaHJlc3BrRGhrSjQwQ2FyRVczTUJmakFGQmdNclpYQXdFREVPTUF3R0ExVUUKQ2hNRmRHRnNiM013SGhjTk1qWXdNVEF6TURFME9UQXlXaGNOTWpjd01UQXpNREUwT1RBeVdqQVRNUkV3RHdZRApWUVFLRXdodmN6cGhaRzFwYmpBcU1BVUdBeXRsY0FNaEFMdTVuclR2aFJCdmF0RWR1cmI2RGlFQTdsdU9tTkxjCm13ZTlvQW9RRGhQUG8wZ3dSakFPQmdOVkhROEJBZjhFQkFNQ0I0QXdFd1lEVlIwbEJBd3dDZ1lJS3dZQkJRVUgKQXdJd0h3WURWUjBqQkJnd0ZvQVVhN3NhQkV4VmVqUVY4L2VjRHJ3eTUvcUNMV2t3QlFZREsyVndBMEVBZStQdwpaRFcxS3lGbUswVmZ5eGtteGRwRWxMYk8wWnhUT3JTSElhYkk0TU5wbWVYR0FKN3k3ZzBnTmF4d0RxSkZ0NnZ6CkVDRU9GZ0Y1emNueTNFeWFDdz09Ci0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K"
          + client_key         = (sensitive value)
        }
      + endpoint                        = "10.0.128.11"
      + id                              = (known after apply)
      + kubeconfig_raw                  = (sensitive value)
      + kubernetes_client_configuration = (known after apply)
      + node                            = "10.0.128.11"
    }

  # module.cluster.talos_machine_bootstrap.this will be created
  + resource "talos_machine_bootstrap" "this" {
      + client_configuration = {
          + ca_certificate     = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUJQekNCOHFBREFnRUNBaEVBNENrcWNhSCs2dW1yRTlNakFRZFMwVEFGQmdNclpYQXdFREVPTUF3R0ExVUUKQ2hNRmRHRnNiM013SGhjTk1qWXdNVEF6TURFME9UQXlXaGNOTXpZd01UQXhNREUwT1RBeVdqQVFNUTR3REFZRApWUVFLRXdWMFlXeHZjekFxTUFVR0F5dGxjQU1oQUFwM01sTVRSZ202YU9vT3dBZ0FCY1ozSnBUbVA1TjM1OEtoClJLU1g1K1pWbzJFd1h6QU9CZ05WSFE4QkFmOEVCQU1DQW9Rd0hRWURWUjBsQkJZd0ZBWUlLd1lCQlFVSEF3RUcKQ0NzR0FRVUZCd01DTUE4R0ExVWRFd0VCL3dRRk1BTUJBZjh3SFFZRFZSME9CQllFRkd1N0dnUk1WWG8wRmZQMwpuQTY4TXVmNmdpMXBNQVVHQXl0bGNBTkJBTWFQTWREaXBkS2M0MndxakNzUDIvMWlEYXA0RC9QV0Vsc3hzazRFCjRwbnpKdmR0ZzZ2QzVLUGxjZlpkdk5VaDBDWmUvampFcWhicWhSUW4wYitkOVFBPQotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg=="
          + client_certificate = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUJLVENCM0tBREFnRUNBaEVBaHJlc3BrRGhrSjQwQ2FyRVczTUJmakFGQmdNclpYQXdFREVPTUF3R0ExVUUKQ2hNRmRHRnNiM013SGhjTk1qWXdNVEF6TURFME9UQXlXaGNOTWpjd01UQXpNREUwT1RBeVdqQVRNUkV3RHdZRApWUVFLRXdodmN6cGhaRzFwYmpBcU1BVUdBeXRsY0FNaEFMdTVuclR2aFJCdmF0RWR1cmI2RGlFQTdsdU9tTkxjCm13ZTlvQW9RRGhQUG8wZ3dSakFPQmdOVkhROEJBZjhFQkFNQ0I0QXdFd1lEVlIwbEJBd3dDZ1lJS3dZQkJRVUgKQXdJd0h3WURWUjBqQkJnd0ZvQVVhN3NhQkV4VmVqUVY4L2VjRHJ3eTUvcUNMV2t3QlFZREsyVndBMEVBZStQdwpaRFcxS3lGbUswVmZ5eGtteGRwRWxMYk8wWnhUT3JTSElhYkk0TU5wbWVYR0FKN3k3ZzBnTmF4d0RxSkZ0NnZ6CkVDRU9GZ0Y1emNueTNFeWFDdz09Ci0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K"
          + client_key         = (sensitive value)
        }
      + endpoint             = "10.0.128.11"
      + id                   = (known after apply)
      + node                 = "10.0.128.11"
    }

  # module.cluster.module.talos-amd-metal["lancer"].talos_machine_configuration_apply.this will be created
  + resource "talos_machine_configuration_apply" "this" {
      + apply_mode                  = "auto"
      + client_configuration        = (sensitive value)
      + config_patches              = [
          + <<-EOT
                version: v1alpha1
                cluster:
                  network:
                    # cilium will become our CNI.
                    cni:
                      name: none
                  controllerManager:
                    extraArgs:
                      # Listen to more than localhost so we can scrape from Alloy.
                      bind-address: 0.0.0.0
                  scheduler:
                    extraArgs:
                      # Listen to more than localhost so we can scrape from Alloy.
                      bind-address: 0.0.0.0
                  apiServer:
                    extraArgs:
                      # Listen to more than localhost so we can scrape from Alloy.
                      bind-address: 0.0.0.0
                  proxy:
                    # Cilium will replace the proxy
                    disabled: true
                machine:
                  sysctls:
                    user.max_user_namespaces: "8192"
                  # https://www.talos.dev/v1.10/talos-guides/configuration/containerd/#exposing-metrics
                  files:
                    - content: |
                        [metrics]
                          address = "0.0.0.0:11234"
                      path: /etc/cri/conf.d/20-customization.part
                      op: create
                  features:
                    rbac: true
                    diskQuotaSupport: true
                    hostDNS:
                      enabled: true
                      resolveMemberNames: true
                      forwardKubeDNSToHost: false
                    imageCache:
                      localEnabled: true
                  install:
                    # wipe: true
                    extraKernelArgs:
                      # 1024x768 for the dashboard:
                      - vga=792
                      # Disable predictable network interface names (use eth0, eth1, etc.)
                      - net.ifnames=0
                      - -talos.halt_if_installed
            EOT,
          + <<-EOT
                "cluster":
                  "clusterName": "tiles"
                  "network":
                    "podSubnets":
                    - "10.0.144.0/20"
                    "serviceSubnets":
                    - "10.0.136.0/21"
                "version": "v1alpha1"
            EOT,
          + <<-EOT
                "machine":
                  "install":
                    "image": "factory.talos.dev/installer/a53e50ce56fa0b0ca1f96d993265508b0608050f6df4b7f4197ef510655d637a:v1.12.0"
            EOT,
          + <<-EOT
                "machine":
                  "kubelet":
                    "extraArgs":
                      "register-with-taints": "dedicated=nodeodm:NoSchedule"
            EOT,
        ]
      + endpoint                    = "10.0.128.51"
      + id                          = (known after apply)
      + machine_configuration       = (sensitive value)
      + machine_configuration_input = (sensitive value)
      + node                        = "10.0.128.51"
    }

  # module.cluster.module.talos-vm["tiles-wk-3"].talos_machine_configuration_apply.this will be created
  + resource "talos_machine_configuration_apply" "this" {
      + apply_mode                  = "auto"
      + client_configuration        = (sensitive value)
      + config_patches              = [
          + <<-EOT
                version: v1alpha1
                cluster:
                  network:
                    # cilium will become our CNI.
                    cni:
                      name: none
                  controllerManager:
                    extraArgs:
                      # Listen to more than localhost so we can scrape from Alloy.
                      bind-address: 0.0.0.0
                  scheduler:
                    extraArgs:
                      # Listen to more than localhost so we can scrape from Alloy.
                      bind-address: 0.0.0.0
                  apiServer:
                    extraArgs:
                      # Listen to more than localhost so we can scrape from Alloy.
                      bind-address: 0.0.0.0
                  proxy:
                    # Cilium will replace the proxy
                    disabled: true
                machine:
                  sysctls:
                    user.max_user_namespaces: "8192"
                  # https://www.talos.dev/v1.10/talos-guides/configuration/containerd/#exposing-metrics
                  files:
                    - content: |
                        [metrics]
                          address = "0.0.0.0:11234"
                      path: /etc/cri/conf.d/20-customization.part
                      op: create
                  features:
                    rbac: true
                    diskQuotaSupport: true
                    hostDNS:
                      enabled: true
                      resolveMemberNames: true
                      forwardKubeDNSToHost: false
                    imageCache:
                      localEnabled: true
                  install:
                    # wipe: true
                    extraKernelArgs:
                      # 1024x768 for the dashboard:
                      - vga=792
                      # Disable predictable network interface names (use eth0, eth1, etc.)
                      - net.ifnames=0
                      - -talos.halt_if_installed
            EOT,
          + <<-EOT
                "cluster":
                  "clusterName": "tiles"
                  "network":
                    "podSubnets":
                    - "10.0.144.0/20"
                    "serviceSubnets":
                    - "10.0.136.0/21"
                "version": "v1alpha1"
            EOT,
          + <<-EOT
                "machine":
                  "install":
                    "image": "factory.talos.dev/installer/10e1d628a0f7dfea781961446a8587d491ec987b40a70ca3dd51194221965f67:v1.12.0"
            EOT,
          + <<-EOT
                "machine":
                  "kubelet":
                    "extraArgs":
                      "register-with-taints": "dedicated=nodeodm:NoSchedule"
            EOT,
        ]
      + endpoint                    = "10.0.128.23"
      + id                          = (known after apply)
      + machine_configuration       = (sensitive value)
      + machine_configuration_input = (sensitive value)
      + node                        = "10.0.128.23"
    }

Plan: 5 to add, 0 to change, 0 to destroy.

  ```

  </details>
  
  